glcloud/keil_v5/ARM/PACK/.Web/NXP.LPC54102_DFP.pdsc
      <device Dname="LPC54102J256">
        <processor Pname="cm4" Dcore="Cortex-M4" Dfpu="SP_FPU" Dendian="Little-endian" Dclock="100000000"/>
        <processor Pname="cm0plus" Dcore="Cortex-M0+" Dfpu="NO_FPU" Dendian="Little-endian" Dclock="100000000"/>
        <environment Pname="cm4" name="iar">
          <file category="linkerfile" name="iar/LPC54102J256_cm4.icf"/>
        </environment>
        <environment Pname="cm0plus" name="iar">
          <file category="linkerfile" name="iar/LPC54102J256_cm0plus.icf"/>
        </environment>
        <sequences>
          <sequence name="ResetProcessor" Pname="cm4">
            <block>
      Sequence("ResetProcessor_LPC5410x_M4");
    </block>
          </sequence>
          <sequence name="ResetProcessor" Pname="cm0plus">
            <block>
      Sequence("ResetProcessor_LPC5410x_M0");
    </block>
          </sequence>
          <sequence name="ResetCatchSet" Pname="cm4">
            <block>
      Sequence("ResetCatchSet_LPC5410x_M4");
    </block>
          </sequence>
          <sequence name="ResetCatchSet" Pname="cm0plus">
            <block>
      Sequence("ResetCatchSet_LPC5410x_M0");
    </block>
          </sequence>
          <sequence name="TraceStart" Pname="cm4">
            <block>
      Sequence("TraceStart_CM4");
    </block>
          </sequence>
          <sequence name="TraceStart" Pname="cm0plus">
            <block>

    </block>
          </sequence>
        </sequences>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x040000" access="rx" default="1" startup="1"/>
        <memory name="SRAM0" start="0x02000000" size="0x010000" access="rw" default="1"/>
        <memory name="SRAM1" start="0x02010000" size="0x8000" access="rw"/>
        <memory name="SRAM2" start="0x03400000" size="0x2000" access="rw"/>
        <algorithm Pname="cm4" name="arm/LPC5410x_256.FLM" start="0x00000000" size="0x00040000" RAMstart="0x02000000" RAMsize="0x00010000" default="1"/>
        <debug svd="LPC54102_cm4.xml" Pname="cm4" __dp="0" __ap="0"/>
        <debug svd="LPC54102_cm0plus.xml" Pname="cm0plus" __dp="0" __ap="1"/>
        <variant Dvariant="LPC54102J256BD64">
          <compile Pname="cm4" header="fsl_device_registers.h" define="CPU_LPC54102J256BD64_cm4"/>
          <compile Pname="cm0plus" header="fsl_device_registers.h" define="CPU_LPC54102J256BD64_cm0plus"/>
          <environment Pname="cm4" name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/LPC54102J256BD64_cm4/LPC54102J256_cm4.scf"</LMisc>
          </environment>
          <environment Pname="cm0plus" name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/LPC54102J256BD64_cm0p/LPC54102J256_cm0plus.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="LPC54102J256UK49">
          <compile Pname="cm4" header="fsl_device_registers.h" define="CPU_LPC54102J256UK49_cm4"/>
          <compile Pname="cm0plus" header="fsl_device_registers.h" define="CPU_LPC54102J256UK49_cm0plus"/>
          <environment Pname="cm4" name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/LPC54102J256UK49_cm4/LPC54102J256_cm4.scf"</LMisc>
          </environment>
          <environment Pname="cm0plus" name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/LPC54102J256UK49_cm0p/LPC54102J256_cm0plus.scf"</LMisc>
          </environment>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="cond_MCUXpressoConfigTools">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="device.LPC54102_AND_driver.lpc_dma">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
    </condition>
    <condition id="device.LPC54102_AND_driver.common_AND_driver.power">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.LPC54102_AND_driver.common">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="core.cm4f_AND_mdk">
      <require Tcompiler="ARMCC"/>
      <require Dcore="Cortex-M4" Dfpu="SP_FPU"/>
    </condition>
    <condition id="core.cm0p_AND_mdk">
      <require Tcompiler="ARMCC"/>
      <require Dcore="Cortex-M0+" Dfpu="NO_FPU"/>
    </condition>
    <condition id="core.cm4f_AND_iar">
      <require Tcompiler="IAR"/>
      <require Dcore="Cortex-M4" Dfpu="SP_FPU"/>
    </condition>
    <condition id="core.cm0p_AND_iar">
      <require Tcompiler="IAR"/>
      <require Dcore="Cortex-M0+" Dfpu="NO_FPU"/>
    </condition>
    <condition id="device.LPC54102_AND_utility.debug_console">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="device.LPC54102_AND_component.lists_AND_utility.debug_console">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
    </condition>
    <condition id="device.LPC54102">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
    </condition>
    <condition id="device.LPC54102_AND_CMSIS_Driver_Include.I2C">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.3.0"/>
    </condition>
