glcloud/keil_v5/ARM/PACK/.Web/NXP.LPC54102_DFP.pdsc
    <condition id="device.LPC54102_AND_driver.vusart">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
    </condition>
    <condition id="device.LPC54102_AND_component.serial_manager_AND_driver.common">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.LPC54102_AND_driver.lpc_dma_AND_driver.lpc_i2c">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
    </condition>
    <condition id="device.LPC54102_AND_driver.lpc_dma_AND_driver.vspi">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
    </condition>
    <condition id="device.LPC54102_AND_driver.lpc_dma_AND_driver.vusart">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
    </condition>
    <condition id="device.LPC54102_AND_CMSIS_Driver_Include.SPI_AND_RTE_Device_AND_driver.vspi_AND_driver.vspi_dma">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.2.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi_dma"/>
    </condition>
    <condition id="device.LPC54102_AND_CMSIS_Driver_Include.I2C_AND_RTE_Device_AND_driver.lpc_i2c_dma">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_dma"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.LPC54102_AND_CMSIS_Driver_Include.USART_AND_RTE_Device_AND_driver.vusart_AND_driver.vusart_dma">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart_dma"/>
    </condition>
    <condition id="device.LPC54102_AND_driver.common_AND_driver.inputmux_connections">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux_connections"/>
    </condition>
    <condition id="device.LPC54102_AND_device.LPC54102_CMSIS_AND_driver.clock_AND_driver.reset">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="reset"/>
    </condition>
    <condition id="device.LPC54102_AND_component.serial_manager_uart_AND_component.vusart_adapter_AND_device.LPC54102_startup_AND_driver.clock_AND_driver.common_AND_driver.lpc_gpio_AND_driver.lpc_iocon_AND_driver.power_AND_driver.vusart_AND_utility.debug_console">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="vusart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="iocon"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
    </condition>
    <condition id="CMSIS_Include_core_cm0plus_OR_CMSIS_Include_core_cm4">
      <accept Cclass="CMSIS" Cgroup="CORE"/>
      <accept Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="device.LPC54102_AND_CMSIS_Include_core_cm0plus_OR_CMSIS_Include_core_cm4">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require condition="CMSIS_Include_core_cm0plus_OR_CMSIS_Include_core_cm4"/>
    </condition>
    <condition id="core.cm0p">
      <require Dcore="Cortex-M0+" Dfpu="NO_FPU"/>
    </condition>
    <condition id="core.cm4f">
      <require Dcore="Cortex-M4" Dfpu="SP_FPU"/>
    </condition>
  </conditions>
  <components>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.LPC54102_AND_driver.lpc_dma">
      <description/>
      <files>
        <file category="header" attr="config" name="template/RTE_Device.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.1.0" condition="device.LPC54102_AND_driver.common_AND_driver.power">
      <description>Clock Driver</description>
      <files>
        <file category="header" name="drivers/fsl_clock.h"/>
        <file category="sourceC" name="drivers/fsl_clock.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="power" Cversion="2.0.0" condition="device.LPC54102_AND_driver.common">
      <description>Power driver with Power Lib Hard ABI</description>
      <files>
        <file category="header" name="drivers/fsl_power.h"/>
        <file category="sourceC" name="drivers/fsl_power.c"/>
        <file condition="core.cm4f_AND_mdk" category="library" name="arm/keil_lib_power.lib"/>
        <file condition="core.cm0p_AND_mdk" category="library" name="arm/keil_lib_power_m0.lib"/>
        <file condition="core.cm4f_AND_iar" category="library" name="iar/iar_lib_power.a"/>
        <file condition="core.cm0p_AND_iar" category="library" name="iar/iar_lib_power_m0.a"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="assert" Cversion="1.0.0" condition="device.LPC54102_AND_utility.debug_console">
      <description/>
      <files>
        <file category="sourceC" name="utilities/fsl_assert.c"/>
      </files>
    </component>
